function miwen = DESJieMi(mingwen)
%参数为明文，64位的0-1字符
K=MiYao();  
U0 = mingwen;
%% 初始置换
ChuShiZhiHuanIP = [58 50 42 34 26 18 10 2;
                    60 52 44 36 28 20 12 4;
                    62 54 46 38 30 22 14 6;
                    64 56 48 40 32 24 16 8;
                    57 49 41 33 25 17 9 1;
                    59 51 43 35 27 19 11 3;
                    61 53 45 37 29 21 13 5;
                    63 55 47 39 31 23 15 7;]
M1 = zeros(8,8);  %M1矩阵存储进行初始置换后的数字矩阵

    for j = 1:8
        for m = 1:8           
                 
             M1(j,m) = str2double(        U0(      ChuShiZhiHuanIP( j,m )      )        );
                 
        end        
    end    

%将置换后的数字矩阵分为两部分
U1=[M1(1,1:8),M1(2,1:8),M1(3,1:8),M1(4,1:8),M1(5,1:8),M1(6,1:8),M1(7,1:8),M1(8,1:8)];
L0 = U1(1:32);
disp('L0');
L0
R0 = U1(33:64);
disp(['R0',R0]);
R0
%%  进行16轮变换

for i =16:-1:1
    disp(i);
    disp('密钥  ');
    K1= K(i,1:48)       %每轮变换使用的密钥
    
    %% Li=Ri-1; Ri = LixorP2 
   
    P2=F(R0,K1);           %F函数           
    disp(['R',i]);
    R1=bitxor(L0,P2)
    disp(['L',i]);
    L1=R0
    
    L0 = L1;               %赋值 进行下一步操作
    R0 = R1;
    disp('\n\n');
end

%%  左右交换
disp('左右交换后  ');
U2 = [R0,L0]

%%  逆初始置换 
NiChuShiZhiHuanIP = [40 8 48 16 56 24 64 32;
                     39 7 47 15 55 23 63 31;
                     38 6 46 14 54 22 62 30;
                     37 5 45 13 53 21 61 29;
                     36 4 44 12 52 20 60 28;
                     35 3 43 11 51 19 59 27;
                     34 2 42 10 50 18 58 26;
                     33 1 41 9 49 17 57 25;];;      %初始置换IP

M2 = zeros(8,8);  %M1矩阵存储进行逆初始置换后的数字矩阵

    for j = 1:8
        for m = 1:8           
               
             M2(j,m) =  U2(     NiChuShiZhiHuanIP(j,m)             ) ;
                   
        end        
    end    

U3=[M2(1,1:8),M2(2,1:8),M2(3,1:8),M2(4,1:8),M2(5,1:8),M2(6,1:8),M2(7,1:8),M2(8,1:8)]; %加密后的密文
miwen=U3;
disp(['逆初始置换结果  ',U3])
end

